# 317. Дано два слова. Скласти програму, яка визначає, чи перше слово 
# починається на ту ж букву, на яку закінчується друге слово.

frWord = str(input("Введіть перше слово: ")).lower()
secWord = str(input("Введіть друге слово: ")).lower()

# print(frWord[0], secWord[-1])
if frWord[0] == secWord[-1]:
    print("Букви співпадають")
else: 
    print("Не співпадають")
