# Дано послідовність символів довжини n (n ≥ 1). Перевірити баланс
# круглих дужок в цьому виразі (кожна відкита дужка має свою закриту дужку).
# Наприклад, при введенні виразу (()) () програма повинна повідомити про
# правильність розстановки дужок (True), а при введенні виразу ((()) - про
# неправильність (False). Напишіть програму, яка може перевіряти баланс дужок
# в арифметичних виразах, тексті і т. д.

expression = input("Введіть вираз для перевірки: ")
if '(' not in expression and ')' not in expression:
    print("У виразі немає дужок для перевірки")
else:
    balance = 0
    for char in expression:
        if char == '(':
            balance += 1
        elif char == ')':
            balance -= 1
            if balance < 0:
                break
    if balance == 0:
        print("True - Дужки розставлені правильно")
    else:
        print("False - Дужки розставлені неправильно")