# Капітан Флінт закопав скарб на Острові скарбів. Він залишив опис, як
# знайти скарб. Опис складається з рядків виду: North 5, де перше слово - одне з
# North, South, East, West, а друге число - кількість кроків, яку потрібно пройти в
# цьому напрямку. Напишіть програму, яка за описом шляху до скарбу визначає
# точні координати скарбу, вважаючи, що початок координат знаходиться на
# початку шляху, вісь OX спрямована на схід, вісь OY - на північ. Програма
# отримує на вхід послідовність рядків зазначеного виду, а введення завершується
# рядком зі словом Treasure!. Програма має вивести два цілих числа в один
# рядок з пропуском між ними - координати скарбу.

x, y = 0, 0
while True:
    command = input("Введіть напрямок і кількість кроків ('Treasure!' для завершення): ")
    if command == "Treasure!":
        break
    direction, steps = command.split()
    steps = int(steps)
    if direction == "North":
        y += steps
    elif direction == "South":
        y -= steps
    elif direction == "East":
        x += steps
    elif direction == "West":
        x -= steps
    else:
        print("Невідомий напрямок. Спробуйте ще раз")
print(f"Координати скарбу: {x} {y}")