# Старшокласники брали участь у вікторині з інформатики. Необхідно
# було відповісти на 20 питань. Переможцем вікторини вважається учасник, який
# правильно відповів на найбільшу кількість запитань. На скільки питань
# переможець відповів правильно? Якщо є учасники вікторини, які не змогли дати
# правильну відповідь ні на одне із запитань, виведіть Yes, інакше виведіть No.
# Гарантується, що є учасники, які правильно відповіли хоча б на одне запитання.
# Программа отримує на вхід число учасників вікторини n (1 ≤ n ≤ 50), потім
# для кожного учасника вводиться кількість питань, на які отримано правильну відповідь.

membersAmount = int(input("Введіть кількість учасників: "))

maxScore = 20
zeroScore = False
winnerScore = 0

print(f"Введіть {membersAmount} результатів:")
for i in range(membersAmount):
    while True:
        score = int(input())
        if 0 <= score <= maxScore:
            break
        else:
            print(f"Кількість правильних відповідей має бути від 0 до {maxScore}. Спробуйте ще раз.")
    if score > winnerScore:
        winnerScore = score
    if score == 0:
        zeroScore = True
print(f"Переможець відповів правильно на {winnerScore} питань.")

if zeroScore == True:
    print("Yes")
else:
    print("No")